//#include <stdio.h>
//#include <stdlib.h>
//int main()
//{
//	//char diamond[5][5] = { {' ',' ','*',' ',' '},{' ','*',' ','*',' '},{'*',' ',' ',' ','*'} {' ','*',' ','*',' '},{' ',' ','*',' ',' '} };
//	int i=0, j=0,m=0;
//	for (i = 0; i < 5; i++)
//	{
//		if (i<5/2+1) //
//		{
//			if (m<5/2+1-i||m>5/2+1+i)
//			{
//				printf(" ");
//			}
//			// 递增排列
//			for (m=5/2+1-i;m<=5/2+1+i;m++)
//			{
//				printf("*");
//			}
//			
//			printf("\n");
//		}else
//		{
//			//  递减排列的2*(5-3)+1,起点是（i-3）
//			for (m=i-(5/2+1);m<i+(5/2+1);m++)
//			{
//				printf("*");
//			}
//		}
//	}
//	//printf("%c", diamond[i][j]);
//	system("pause");
//	return 0;
//}